In [1]:
import pandas as pd
import numpy as np

d = {'Name': ['Heshan','Tharushka','Chathuranga'],'Age' : [20,21,22]}
df = pd.DataFrame(d)
df

#DataFrames are preferred when you have mixed data types, need labeled rows and columns, or want to leverage the many built-in functions 
#for data manipulation and analysis that Pandas provides. Arrays, on the other hand, are better for homogeneous data types 
#and operations that require high performance, typically in numerical computations.

          Name  Age
0       Heshan   20
1    Tharushka   21
2  Chathuranga   22

In [2]:
df1 = pd.read_csv("..\\CSV\\iris.csv")
#pd.read_csv(r"..\CSV\iris.csv")
#pd.read_csv("../CSV/iris.csv)


df1

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0    1001           5.1          3.5           1.4          0.2     setosa
1    1002           4.9          3.0           1.4          0.2     setosa
2    1003           4.7          3.2           1.3          0.2     setosa
3    1004           4.6          3.1           1.5          0.2     setosa
4    1005           5.0          3.6           1.4          0.2     setosa
..    ...           ...          ...           ...          ...        ...
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

[150 rows x 6 columns]

In [3]:
df1.head() # this will give first 5 rows

     Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0  1001           5.1          3.5           1.4          0.2  setosa
1  1002           4.9          3.0           1.4          0.2  setosa
2  1003           4.7          3.2           1.3          0.2  setosa
3  1004           4.6          3.1           1.5          0.2  setosa
4  1005           5.0          3.6           1.4          0.2  setosa

In [4]:
import pandas as pd

# Creating a DataFrame with columns of different data types
data = {
    'IntegerColumn': [1, 2, 3, 4, 5],
    'MixedColumn': [1, 2, 3, 'sada', 5],
    'FloatColumn': [1.1, 2.2, 3.3, 4.4, 5.5],
    'StringColumn': ['a', 'b', 'c', 'd', 'e'],
    'BooleanColumn': [True, False, True, False, True],
    'DatetimeColumn': pd.to_datetime(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04', '2021-01-05'])
}

df = pd.DataFrame(data)

# Displaying the data types of each column
print(df.dtypes)

IntegerColumn              int64
MixedColumn               object
FloatColumn              float64
StringColumn              object
BooleanColumn               bool
DatetimeColumn    datetime64[ns]
dtype: object

In [5]:
df1.head(10) #this will give first 10 rows

     Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0  1001           5.1          3.5           1.4          0.2  setosa
1  1002           4.9          3.0           1.4          0.2  setosa
2  1003           4.7          3.2           1.3          0.2  setosa
3  1004           4.6          3.1           1.5          0.2  setosa
4  1005           5.0          3.6           1.4          0.2  setosa
5  1006           5.4          3.9           1.7          0.4  setosa
6  1007           4.6          3.4           1.4          0.3  setosa
7  1008           5.0          3.4           1.5          0.2  setosa
8  1009           4.4          2.9           1.4          0.2  setosa
9  1010           4.9          3.1           1.5          0.1  setosa

In [6]:
df1.tail(4)

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

In [7]:
df1.describe()

                Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count   150.000000    150.000000   150.000000    150.000000   150.000000
mean   1075.500000      5.843333     3.057333      3.758000     1.199333
std      43.445368      0.828066     0.435866      1.765298     0.762238
min    1001.000000      4.300000     2.000000      1.000000     0.100000
25%    1038.250000      5.100000     2.800000      1.600000     0.300000
50%    1075.500000      5.800000     3.000000      4.350000     1.300000
75%    1112.750000      6.400000     3.300000      5.100000     1.800000
max    1150.000000      7.900000     4.400000      6.900000     2.500000

In [8]:
data = {'Name' : ["Sun","Mon","Tue","Sun","Mon"],
        'Marks': [56,32,54,56,32],
        'Class'  : [1,2,3,1,2]}

df = pd.DataFrame(data)
print(df)

print(df.duplicated(keep=False)) # checking each row is duplicated or not
print(df.duplicated(keep='first')) # checking each row is duplicated or not but the first duplicated row is False
df.drop_duplicates(keep='last')

#keep='first' (default): Keeps the first occurrence of each duplicate.
#keep='last': Keeps the last occurrence of each duplicate.
#keep=False: Removes all duplicates.

  Name  Marks  Class
0  Sun     56      1
1  Mon     32      2
2  Tue     54      3
3  Sun     56      1
4  Mon     32      2
0     True
1     True
2    False
3     True
4     True
dtype: bool
0    False
1    False
2    False
3     True
4     True
dtype: bool

  Name  Marks  Class
2  Tue     54      3
3  Sun     56      1
4  Mon     32      2

In [9]:
data = {'Name' : ["Sun","Mon","Tue",None ],
        'Marks': [56,32,np.nan,56],
        'Class'  : [1,2,3,1]}
#IF there are null values we should name as None if it's String and if it is numerical use np.nan

df = pd.DataFrame(data)

print(df)
print("\n\n")
#remove duplicate rows
df_no_nan_rows = df.dropna()
print(df_no_nan_rows)
print("\n\n")

#remove duplicate coloums
df_no_nan_col = df.dropna(axis=1)

print(df_no_nan_col)

   Name  Marks  Class
0   Sun   56.0      1
1   Mon   32.0      2
2   Tue    NaN      3
3  None   56.0      1



  Name  Marks  Class
0  Sun   56.0      1
1  Mon   32.0      2



   Class
0      1
1      2
2      3
3      1

In [10]:
df = pd.DataFrame({"Col1" : [12,2,25,32,45],"Col2" : [45,43,33,36,54],"col3":[23,45,32,45,43]})
df.columns

Index(['Col1', 'Col2', 'col3'], dtype='object')

In [11]:
df['Col1']

0    12
1     2
2    25
3    32
4    45
Name: Col1, dtype: int64

In [12]:
df = pd.DataFrame({"A" : [1,2,3]})
print(df)

   A
0  1
1  2
2  3

In [13]:
df = pd.DataFrame({'A' : [1,2,3]},index = [10,20,30])
df

    A
10  1
20  2
30  3

In [14]:
print(df.loc[10]) # this use only if change indexes

A    1
Name: 10, dtype: int64

In [15]:
print(df.iloc[0]) # this is defualt indexes this will take first row .if it was changed to 10

A    1
Name: 10, dtype: int64

In [16]:
df.iloc[[0,1,2]]

    A
10  1
20  2
30  3

In [17]:
df = pd.DataFrame({"Col1" : [12,2,25,32,45],"Col2" : [45,43,33,36,54],"col3":[23,45,32,45,43]})
df.columns

Index(['Col1', 'Col2', 'col3'], dtype='object')

In [18]:
df[['Col1','Col2']] #2d array because we need to get more than two columns

   Col1  Col2
0    12    45
1     2    43
2    25    33
3    32    36
4    45    54

In [20]:
#if we want only one col then we just use only 1D array
df.iloc[1]

Col1     2
Col2    43
col3    45
Name: 1, dtype: int64

In [22]:
df.iloc[1:4,1:] # print all 1,2,3 rows and all columns from 1

   Col2  col3
1    43    45
2    33    32
3    36    45

In [30]:
df = pd.DataFrame({'Name' : ['A','B','C'], 'Age' : [23,33,21],'Result' : ['Pass','Fail','Pass']} , index = ['a','b','c'])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [36]:
print(df.drop('Age',axis = 1)) #default inplace = False
# if inplace pass as True then df value will changed but now it will not change
print("\n")
print(df)

  Name Result
a    A   Pass
b    B   Fail
c    C   Pass

In [38]:
#but if we pass inplace as True then df will change
df.drop('Age',axis =1 ,inplace = True)
print(df)

None
  Name Result
a    A   Pass
b    B   Fail
c    C   Pass

In [40]:
df.drop('a',axis = 0)

  Name Result
b    B   Fail
c    C   Pass